src/ExchangePlans/ОбменССайтом_Розница.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<ExchangePlan>
		<Properties>
			<Name>ОбменССайтом_Розница</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУзла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Входящий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исходящий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

src/ExchangePlans/ОбменССайтом_Розница/Ext/ManagerModule.bsl
#Область   Загрузка
Функция ЗагрузитьСообщениеОбмена() Экспорт
 ОбменССайтомСервер.ПолучитьДанныеССайта(ЭтотУзел(),"retail_orders");	
КонецФункции

Функция УзелПланаОбмена(Входящий = Истина) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОбменССайтом_Розница.Ссылка
	                      |ИЗ
	                      |	ПланОбмена.ОбменССайтом_Розница КАК ОбменССайтом_Розница
	                      |ГДЕ
	                      |	НЕ ОбменССайтом_Розница.ЭтотУзел
	                      |	И (&Входящий
	                      |				И ОбменССайтом_Розница.Входящий
	                      |			ИЛИ НЕ &Входящий
	                      |				И ОбменССайтом_Розница.Исходящий)");
	Запрос.УстановитьПараметр("Входящий", Входящий);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, ЭтотУзел());
	
КонецФункции

#КонецОбласти

#Область Обработка
Процедура ОбработатьОбъекты() Экспорт
 ОбменССайтомСервер.ОбработатьОбъектыОбмена(ЭтотУзел());
		
КонецПроцедуры
#КонецОбласти
